# ch01. Python 기초 사용법

[Google](https://google.com)


```python
import pandas as pd
```

> 인용문
>> 중첩된 인용문
>>> 중첩된 인용문2

---

| 값 | 의미 | 기본값 |
|---|:---:|---:|
| `static` | 유형(기준) 없음 / 배치 불가능 | `static` |
| `relative` | 요소 자신을 기준으로 배치 |  |
| `absolute` | 위치 상 부모(조상)요소를 기준으로 배치 |  |
| `fixed` | 브라우저 창을 기준으로 배치 |  |

In [6]:
tx = "Hello!"
print(tx[0])
print(tx[3])
print(tx[0:4])
print(tx[-1])
print(tx[-3])
print(tx[2:])
print(tx[:2])

H
l
Hell
!
l
llo!
He

In [27]:
aa = [1, 2, 3]
bb = [4, 5, 6]
print(aa + bb)
print(aa * 3)

print(aa[1:3])

bb = [1, 2, ["a", "b", "c"]]
print(bb[2][0])
print(bb[2][-3:])

[1, 2, 3, 4, 5, 6]
[1, 2, 3, 1, 2, 3, 1, 2, 3]
[2, 3]
a
['a', 'b', 'c']

In [33]:
bb = [2, 3, 4]
bb[2] = [99, 99]
print(bb)
dd = [4, 5, 6]
print(dd[0:2])
print(dd)

[2, 3, [99, 99]]
[4, 5]
[4, 5, 6]

In [35]:
kk = [1, 2, 3]
del kk[0]
print(kk)
print(kk[0])

[2, 3]
2

In [42]:
ww = [2, 5, 4]
ww.reverse()
print(ww)

[4, 5, 2]

In [50]:
mm = [1, 2, 3]
mm.index(3)
mm.insert(2, 99)
mm

[1, 2, 99, 3]

In [2]:
import pandas as pd 
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [9]:
group_by_sex = df.groupby('sex')
group_by_sex.groups
print(group)

NameError: name 'group' is not defined

In [3]:
f = open("C:/Users/eg21k/code/learncode/매수종목1.txt", mode="wt", encoding="utf-8")
f.write("005930\n")
f.write("005380\n")
f.write("035420")
f.close()